; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l41_p41_c41_g41_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	loc36 - location
	loc37 - location
	loc38 - location
	loc39 - location
	loc40 - location
	loc41 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	crate37 - crate
	crate38 - crate
	crate39 - crate
	crate40 - crate
	crate41 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	person40 - person
	person41 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(crate-at crate30 depot)
	(crate-at crate31 depot)
	(crate-at crate32 depot)
	(crate-at crate33 depot)
	(crate-at crate34 depot)
	(crate-at crate35 depot)
	(crate-at crate36 depot)
	(crate-at crate37 depot)
	(crate-at crate38 depot)
	(crate-at crate39 depot)
	(crate-at crate40 depot)
	(crate-at crate41 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(content-crate medicine crate32)
	(content-crate medicine crate33)
	(content-crate medicine crate34)
	(content-crate medicine crate35)
	(content-crate medicine crate36)
	(content-crate medicine crate37)
	(content-crate medicine crate38)
	(content-crate medicine crate39)
	(content-crate medicine crate40)
	(content-crate medicine crate41)
	(person-at person1 loc20)
	(person-at person2 loc20)
	(person-at person3 loc3)
	(person-at person4 loc31)
	(person-at person5 loc30)
	(person-at person6 loc9)
	(person-at person7 loc26)
	(person-at person8 loc16)
	(person-at person9 loc37)
	(person-at person10 loc24)
	(person-at person11 loc16)
	(person-at person12 loc18)
	(person-at person13 loc5)
	(person-at person14 loc8)
	(person-at person15 loc19)
	(person-at person16 loc31)
	(person-at person17 loc18)
	(person-at person18 loc7)
	(person-at person19 loc39)
	(person-at person20 loc3)
	(person-at person21 loc31)
	(person-at person22 loc39)
	(person-at person23 loc35)
	(person-at person24 loc17)
	(person-at person25 loc33)
	(person-at person26 loc4)
	(person-at person27 loc2)
	(person-at person28 loc37)
	(person-at person29 loc37)
	(person-at person30 loc21)
	(person-at person31 loc12)
	(person-at person32 loc12)
	(person-at person33 loc41)
	(person-at person34 loc38)
	(person-at person35 loc37)
	(person-at person36 loc1)
	(person-at person37 loc36)
	(person-at person38 loc15)
	(person-at person39 loc35)
	(person-at person40 loc6)
	(person-at person41 loc18)
	(person-need person2 food)
	(person-need person2 medicine)
	(person-need person3 medicine)
	(person-need person4 food)
	(person-need person5 medicine)
	(person-need person7 food)
	(person-need person7 medicine)
	(person-need person8 food)
	(person-need person9 food)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person13 medicine)
	(person-need person14 food)
	(person-need person17 food)
	(person-need person18 food)
	(person-need person18 medicine)
	(person-need person19 food)
	(person-need person19 medicine)
	(person-need person20 medicine)
	(person-need person22 food)
	(person-need person23 food)
	(person-need person24 food)
	(person-need person24 medicine)
	(person-need person25 food)
	(person-need person25 medicine)
	(person-need person26 food)
	(person-need person29 food)
	(person-need person29 medicine)
	(person-need person30 food)
	(person-need person31 food)
	(person-need person32 food)
	(person-need person32 medicine)
	(person-need person33 food)
	(person-need person33 medicine)
	(person-need person35 food)
	(person-need person35 medicine)
	(person-need person36 food)
	(person-need person36 medicine)
	(person-need person38 food)
	(person-need person39 medicine)
	(person-need person40 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person5 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person18 medicine)
	(has-content-person person19 food)
	(has-content-person person19 medicine)
	(has-content-person person20 medicine)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person24 food)
	(has-content-person person24 medicine)
	(has-content-person person25 food)
	(has-content-person person25 medicine)
	(has-content-person person26 food)
	(has-content-person person29 food)
	(has-content-person person29 medicine)
	(has-content-person person30 food)
	(has-content-person person31 food)
	(has-content-person person32 food)
	(has-content-person person32 medicine)
	(has-content-person person33 food)
	(has-content-person person33 medicine)
	(has-content-person person35 food)
	(has-content-person person35 medicine)
	(has-content-person person36 food)
	(has-content-person person36 medicine)
	(has-content-person person38 food)
	(has-content-person person39 medicine)
	(has-content-person person40 food)
))
)

; plan
1. (pick-up-crate crate41 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate41 depot)
   added: (has-crate-drone-arm right crate41)
   goals met: 1 of 42
2. (pick-up-crate crate23 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate23 depot)
   added: (has-crate-drone-arm left crate23)
   goals met: 1 of 42
3. (drone-move depot loc31 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc31)
   goals met: 0 of 42
4. (drop-crate loc31 person4 crate23 left food drone1)
   deleted: (has-crate-drone-arm left crate23)
   added: (has-content-person person4 food) (empty-arm left)
   goals met: 1 of 42
5. (drone-move loc31 depot drone1)
   deleted: (drone-at drone1 loc31)
   added: (drone-at drone1 depot)
   goals met: 2 of 42
6. (pick-up-crate crate22 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate22 depot)
   added: (has-crate-drone-arm left crate22)
   goals met: 2 of 42
7. (drone-move depot loc30 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc30)
   goals met: 1 of 42
8. (drop-crate loc30 person5 crate41 right medicine drone1)
   deleted: (has-crate-drone-arm right crate41)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 2 of 42
9. (drone-move loc30 depot drone1)
   deleted: (drone-at drone1 loc30)
   added: (drone-at drone1 depot)
   goals met: 3 of 42
10. (pick-up-crate crate40 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate40 depot)
   added: (has-crate-drone-arm right crate40)
   goals met: 3 of 42
11. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 2 of 42
12. (drop-crate loc21 person30 crate22 left food drone1)
   deleted: (has-crate-drone-arm left crate22)
   added: (has-content-person person30 food) (empty-arm left)
   goals met: 3 of 42
13. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 4 of 42
14. (pick-up-crate crate21 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate21 depot)
   added: (has-crate-drone-arm left crate21)
   goals met: 4 of 42
15. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 3 of 42
16. (drop-crate loc15 person38 crate21 left food drone1)
   deleted: (has-crate-drone-arm left crate21)
   added: (has-content-person person38 food) (empty-arm left)
   goals met: 4 of 42
17. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 5 of 42
18. (pick-up-crate crate20 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate20 depot)
   added: (has-crate-drone-arm left crate20)
   goals met: 5 of 42
19. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 4 of 42
20. (drop-crate loc8 person14 crate20 left food drone1)
   deleted: (has-crate-drone-arm left crate20)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 5 of 42
21. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 6 of 42
22. (pick-up-crate crate19 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate19 depot)
   added: (has-crate-drone-arm left crate19)
   goals met: 6 of 42
23. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 5 of 42
24. (drop-crate loc6 person40 crate19 left food drone1)
   deleted: (has-crate-drone-arm left crate19)
   added: (has-content-person person40 food) (empty-arm left)
   goals met: 6 of 42
25. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 7 of 42
26. (pick-up-crate crate18 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate18 depot)
   added: (has-crate-drone-arm left crate18)
   goals met: 7 of 42
27. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 6 of 42
28. (drop-crate loc5 person13 crate40 right medicine drone1)
   deleted: (has-crate-drone-arm right crate40)
   added: (has-content-person person13 medicine) (empty-arm right)
   goals met: 7 of 42
29. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 8 of 42
30. (pick-up-crate crate39 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate39 depot)
   added: (has-crate-drone-arm right crate39)
   goals met: 8 of 42
31. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 7 of 42
32. (drop-crate loc4 person26 crate18 left food drone1)
   deleted: (has-crate-drone-arm left crate18)
   added: (has-content-person person26 food) (empty-arm left)
   goals met: 8 of 42
33. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 9 of 42
34. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate17 depot)
   added: (has-crate-drone-arm left crate17)
   goals met: 9 of 42
35. (drone-move depot loc41 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc41)
   goals met: 8 of 42
36. (drop-crate loc41 person33 crate17 left food drone1)
   deleted: (has-crate-drone-arm left crate17)
   added: (has-content-person person33 food) (empty-arm left)
   goals met: 9 of 42
37. (drop-crate loc41 person33 crate39 right medicine drone1)
   deleted: (has-crate-drone-arm right crate39)
   added: (has-content-person person33 medicine) (empty-arm right)
   goals met: 10 of 42
38. (drone-move loc41 depot drone1)
   deleted: (drone-at drone1 loc41)
   added: (drone-at drone1 depot)
   goals met: 11 of 42
39. (pick-up-crate crate38 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate38 depot)
   added: (has-crate-drone-arm right crate38)
   goals met: 11 of 42
40. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate16 depot)
   added: (has-crate-drone-arm left crate16)
   goals met: 11 of 42
41. (drone-move depot loc39 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc39)
   goals met: 10 of 42
42. (drop-crate loc39 person19 crate16 left food drone1)
   deleted: (has-crate-drone-arm left crate16)
   added: (has-content-person person19 food) (empty-arm left)
   goals met: 11 of 42
43. (drone-move loc39 depot drone1)
   deleted: (drone-at drone1 loc39)
   added: (drone-at drone1 depot)
   goals met: 12 of 42
44. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate15 depot)
   added: (has-crate-drone-arm left crate15)
   goals met: 12 of 42
45. (drone-move depot loc39 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc39)
   goals met: 11 of 42
46. (drop-crate loc39 person19 crate38 right medicine drone1)
   deleted: (has-crate-drone-arm right crate38)
   added: (has-content-person person19 medicine) (empty-arm right)
   goals met: 12 of 42
47. (drop-crate loc39 person22 crate15 left food drone1)
   deleted: (has-crate-drone-arm left crate15)
   added: (has-content-person person22 food) (empty-arm left)
   goals met: 13 of 42
48. (drone-move loc39 depot drone1)
   deleted: (drone-at drone1 loc39)
   added: (drone-at drone1 depot)
   goals met: 14 of 42
49. (pick-up-crate crate37 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate37 depot)
   added: (has-crate-drone-arm right crate37)
   goals met: 14 of 42
50. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate14 depot)
   added: (has-crate-drone-arm left crate14)
   goals met: 14 of 42
51. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 13 of 42
52. (drop-crate loc37 person9 crate14 left food drone1)
   deleted: (has-crate-drone-arm left crate14)
   added: (has-content-person person9 food) (empty-arm left)
   goals met: 14 of 42
53. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 15 of 42
54. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 15 of 42
55. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 14 of 42
56. (drop-crate loc37 person29 crate13 left food drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person29 food) (empty-arm left)
   goals met: 15 of 42
57. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 16 of 42
58. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 16 of 42
59. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 15 of 42
60. (drop-crate loc37 person29 crate37 right medicine drone1)
   deleted: (has-crate-drone-arm right crate37)
   added: (has-content-person person29 medicine) (empty-arm right)
   goals met: 16 of 42
61. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 17 of 42
62. (pick-up-crate crate36 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate36 depot)
   added: (has-crate-drone-arm right crate36)
   goals met: 17 of 42
63. (drone-move depot loc37 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc37)
   goals met: 16 of 42
64. (drop-crate loc37 person35 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person35 food) (empty-arm left)
   goals met: 17 of 42
65. (drop-crate loc37 person35 crate36 right medicine drone1)
   deleted: (has-crate-drone-arm right crate36)
   added: (has-content-person person35 medicine) (empty-arm right)
   goals met: 18 of 42
66. (drone-move loc37 depot drone1)
   deleted: (drone-at drone1 loc37)
   added: (drone-at drone1 depot)
   goals met: 19 of 42
67. (pick-up-crate crate35 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate35 depot)
   added: (has-crate-drone-arm right crate35)
   goals met: 19 of 42
68. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 19 of 42
69. (drone-move depot loc35 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc35)
   goals met: 18 of 42
70. (drop-crate loc35 person23 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person23 food) (empty-arm left)
   goals met: 19 of 42
71. (drop-crate loc35 person39 crate35 right medicine drone1)
   deleted: (has-crate-drone-arm right crate35)
   added: (has-content-person person39 medicine) (empty-arm right)
   goals met: 20 of 42
72. (drone-move loc35 depot drone1)
   deleted: (drone-at drone1 loc35)
   added: (drone-at drone1 depot)
   goals met: 21 of 42
73. (pick-up-crate crate34 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate34 depot)
   added: (has-crate-drone-arm right crate34)
   goals met: 21 of 42
74. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 21 of 42
75. (drone-move depot loc33 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc33)
   goals met: 20 of 42
76. (drop-crate loc33 person25 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person25 food) (empty-arm left)
   goals met: 21 of 42
77. (drop-crate loc33 person25 crate34 right medicine drone1)
   deleted: (has-crate-drone-arm right crate34)
   added: (has-content-person person25 medicine) (empty-arm right)
   goals met: 22 of 42
78. (drone-move loc33 depot drone1)
   deleted: (drone-at drone1 loc33)
   added: (drone-at drone1 depot)
   goals met: 23 of 42
79. (pick-up-crate crate33 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate33 depot)
   added: (has-crate-drone-arm right crate33)
   goals met: 23 of 42
80. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 23 of 42
81. (drone-move depot loc26 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc26)
   goals met: 22 of 42
82. (drop-crate loc26 person7 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 23 of 42
83. (drop-crate loc26 person7 crate33 right medicine drone1)
   deleted: (has-crate-drone-arm right crate33)
   added: (has-content-person person7 medicine) (empty-arm right)
   goals met: 24 of 42
84. (drone-move loc26 depot drone1)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 depot)
   goals met: 25 of 42
85. (pick-up-crate crate32 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate32 depot)
   added: (has-crate-drone-arm right crate32)
   goals met: 25 of 42
86. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 25 of 42
87. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 24 of 42
88. (drop-crate loc20 person2 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 25 of 42
89. (drop-crate loc20 person2 crate32 right medicine drone1)
   deleted: (has-crate-drone-arm right crate32)
   added: (has-content-person person2 medicine) (empty-arm right)
   goals met: 26 of 42
90. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 27 of 42
91. (pick-up-crate crate31 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate31 depot)
   added: (has-crate-drone-arm right crate31)
   goals met: 27 of 42
92. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 27 of 42
93. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 26 of 42
94. (drop-crate loc18 person12 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm right crate31)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 27 of 42
95. (drop-crate loc18 person17 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person17 food) (empty-arm left)
   goals met: 28 of 42
96. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 29 of 42
97. (pick-up-crate crate30 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate30 depot)
   added: (has-crate-drone-arm right crate30)
   goals met: 29 of 42
98. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 29 of 42
99. (drone-move depot loc17 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc17)
   goals met: 28 of 42
100. (drop-crate loc17 person24 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person24 food) (empty-arm left)
   goals met: 29 of 42
101. (drop-crate loc17 person24 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm right crate30)
   added: (has-content-person person24 medicine) (empty-arm right)
   goals met: 30 of 42
102. (drone-move loc17 depot drone1)
   deleted: (drone-at drone1 loc17)
   added: (drone-at drone1 depot)
   goals met: 31 of 42
103. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate29 depot)
   added: (has-crate-drone-arm right crate29)
   goals met: 31 of 42
104. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 31 of 42
105. (drone-move depot loc16 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc16)
   goals met: 30 of 42
106. (drop-crate loc16 person8 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person8 food) (empty-arm left)
   goals met: 31 of 42
107. (drop-crate loc16 person11 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm right crate29)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 32 of 42
108. (drone-move loc16 depot drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 depot)
   goals met: 33 of 42
109. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate28 depot)
   added: (has-crate-drone-arm right crate28)
   goals met: 33 of 42
110. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 33 of 42
111. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 32 of 42
112. (drop-crate loc12 person31 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person31 food) (empty-arm left)
   goals met: 33 of 42
113. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 34 of 42
114. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 34 of 42
115. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 33 of 42
116. (drop-crate loc12 person32 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person32 food) (empty-arm left)
   goals met: 34 of 42
117. (drop-crate loc12 person32 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm right crate28)
   added: (has-content-person person32 medicine) (empty-arm right)
   goals met: 35 of 42
118. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 36 of 42
119. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate27 depot)
   added: (has-crate-drone-arm right crate27)
   goals met: 36 of 42
120. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 36 of 42
121. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 35 of 42
122. (drop-crate loc7 person18 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person18 food) (empty-arm left)
   goals met: 36 of 42
123. (drop-crate loc7 person18 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm right crate27)
   added: (has-content-person person18 medicine) (empty-arm right)
   goals met: 37 of 42
124. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 38 of 42
125. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate26 depot)
   added: (has-crate-drone-arm right crate26)
   goals met: 38 of 42
126. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 38 of 42
127. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 37 of 42
128. (drop-crate loc1 person36 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person36 food) (empty-arm left)
   goals met: 38 of 42
129. (drop-crate loc1 person36 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm right crate26)
   added: (has-content-person person36 medicine) (empty-arm right)
   goals met: 39 of 42
130. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 40 of 42
131. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 40 of 42
132. (pick-up-crate crate24 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate24 depot)
   added: (has-crate-drone-arm left crate24)
   goals met: 40 of 42
133. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 39 of 42
134. (drop-crate loc3 person3 crate24 left medicine drone1)
   deleted: (has-crate-drone-arm left crate24)
   added: (has-content-person person3 medicine) (empty-arm left)
   goals met: 40 of 42
135. (drop-crate loc3 person20 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person20 medicine) (empty-arm right)
   goals met: 41 of 42
136. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 42 of 42
